updated docs, and fixed some minor bugs in the settings including removing vestigal ai summery checkbox and making appearance work
